In [6]:
import pandas as pd
account = {
    "student_ID": [100, 101, 201, 331],
    "first_name": ["Ayush", "Ryan", "Chisato", "Isabelle"],
    "last_name": ["Adhikari", "Griffin", "Nii", "Bui"],
    "University": ["CSU", "CSU", "CSU", "DU"],
    "Major": ["CIS", "CS", "Piano", "Nutrition"],
    "Salary": [200000, 100000, 50000, 75000],
    "Age": [21, 22, 30, 20],
    "GPA": [4.0, 4.0, 3.5, 3.8],
}

df = pd.DataFrame(account)

In [7]:
df.describe()

       student_ID         Salary        Age       GPA
count    4.000000       4.000000   4.000000  4.000000
mean   183.250000  106250.000000  23.250000  3.825000
std    109.301952   65748.890992   4.573474  0.236291
min    100.000000   50000.000000  20.000000  3.500000
25%    100.750000   68750.000000  20.750000  3.725000
50%    151.000000   87500.000000  21.500000  3.900000
75%    233.500000  125000.000000  24.000000  4.000000
max    331.000000  200000.000000  30.000000  4.000000

In [9]:
df.set_index("student_ID", inplace = True)

In [10]:
df.describe()

              Salary        Age       GPA
count       4.000000   4.000000  4.000000
mean   106250.000000  23.250000  3.825000
std     65748.890992   4.573474  0.236291
min     50000.000000  20.000000  3.500000
25%     68750.000000  20.750000  3.725000
50%     87500.000000  21.500000  3.900000
75%    125000.000000  24.000000  4.000000
max    200000.000000  30.000000  4.000000

In [11]:
df["GPA"].median()

3.9

In [15]:
df2 = pd.read_csv("survey_results_public.csv")

In [45]:
filt = (df2["Country"] == "United States") & (df2["Age"] >= 20) & (df2["Age"] <= 25)
df2.loc[filt, ["Age", "ConvertedComp"]].value_counts().sort_values(ascending = False)

Age   ConvertedComp
25.0  100000.0         23
24.0  75000.0          18
25.0  85000.0          15
      60000.0          14
24.0  2000000.0        13
                       ..
25.0  82500.0           1
      82941.0           1
      61949.0           1
      61000.0           1
23.0  1920000.0         1
Length: 556, dtype: int64

In [47]:
df2.loc[filt, ["ConvertedComp"]].median()

ConvertedComp    82033.5
dtype: float64

In [83]:
country_group = df2.groupby(["Country"])

In [102]:
country_group["UndergradMajor"].value_counts(normalize = True).loc["Japan"]

UndergradMajor
Computer science, computer engineering, or software engineering                   0.578947
Another engineering discipline (such as civil, electrical, mechanical, etc.)      0.121457
Information systems, information technology, or system administration             0.072874
A humanities discipline (such as literature, history, philosophy, etc.)           0.048583
A natural science (such as biology, chemistry, physics, etc.)                     0.048583
A social science (such as anthropology, psychology, political science, etc.)      0.028340
Web development or web design                                                     0.028340
A business discipline (such as accounting, finance, marketing, etc.)              0.024291
Mathematics or statistics                                                         0.020243
Fine arts or performing arts (such as graphic design, music, studio art, etc.)    0.016194
I never declared a major                                                          0.012146
Name: UndergradMajor, dtype: float64

In [87]:
country_group["ConvertedComp"].mean().loc["Canada"]

115101.77546468402

In [90]:
country_group["ConvertedComp"].agg(["median", "mean", "max", "min"])

,median,mean,max,min
Country,,,,
Afghanistan,15163.5,148290.125000,1000000.0,0.0
Albania,15900.0,25611.000000,194580.0,0.0
Algeria,9432.0,10362.812500,36000.0,300.0
Andorra,88640.0,88640.000000,141608.0,35672.0
Angola,5292.0,5292.000000,5736.0,4848.0
...,...,...,...,...
"Venezuela, Bolivarian Republic of...",3600.0,6280.611111,24000.0,96.0
Viet Nam,10344.0,28342.605769,1000000.0,0.0
Yemen,36000.0,36000.000000,36000.0,36000.0
Zambia,5452.0,17506.400000,60000.0,816.0
Zimbabwe,7200.0,26338.181818,180000.0,1200.0

In [101]:
country_group["LanguageWorkedWith"].apply(lambda x: x.str.contains("Python").sum())

Country
Afghanistan                              11
Albania                                  13
Algeria                                  40
Andorra                                   3
Angola                                    1
                                       ...
Venezuela, Bolivarian Republic of...     29
Viet Nam                                102
Yemen                                     1
Zambia                                    4
Zimbabwe                                 13
Name: LanguageWorkedWith, Length: 183, dtype: int64

In [105]:
country_totals = df2["Country"].value_counts()
country_python = country_group["LanguageWorkedWith"].apply(lambda x: x.str.contains("Python").sum())

In [114]:
python_df = pd.concat([country_totals, country_python], axis = "columns", sort = False)

In [122]:
python_df.rename(columns = {"Country": "NumRespondents", "LanguageWorkedWith": "NumKnowsPython"}, inplace = True)

In [166]:
python_df["% Knows Python"] = (python_df["NumKnowsPython"] / python_df["NumRespondents"] * 100).round(2)

In [167]:
python_df.sort_values(by = "% Knows Python", ascending = False)

,NumRespondents,NumKnowsPython,% Knows Python
Gabon,1,1,100.00
Saint Lucia,1,1,100.00
"Micronesia, Federated States of...",1,1,100.00
Montenegro,13,9,69.23
Brunei Darussalam,3,2,66.67
...,...,...,...
Monaco,2,0,0.00
Niger,5,0,0.00
Saint Vincent and the Grenadines,3,0,0.00
Gambia,4,0,0.00
Marshall Islands,1,0,0.00